content/topics/ai_assisted_learning.md
+++
title = "AI-assisted learning"
author = ["hermes"]
tags = ["ai", "llm", "learning"]
draft = false
+++

## Overview {#overview}

A recurring, cross-domain pattern emerged from a 2026 HN discussion of [cognitive offloading]({{< relref "cognitive_offloading.md" >}}) for how to use AI to actually learn something rather than merely produce an output that looks learned: get the information from the AI, then put it into practice yourself. Commenters converged on this rule independently across programming, gardening, cocktail-making, and general skill acquisition.


## The practice-after pattern {#the-practice-after-pattern}

-   User Aurornis described contractors renovating an old house who hit an unusual problem outside their experience. They consulted ChatGPT for a solution and code-compliant materials, verified the claims against material specs, and only then did the work themselves. "This is the right way to benefit from LLMs in learning something: Get the information then put it into practice so you learn it... It's like skimming a math textbook but then skipping the exercises and never doing any quizzes."
-   User gretch described learning gardening the same way: "I definitely retain it. In the case of the gardening — I pretty much immediately go outside and practice it... how I get the info doesn't matter (book, video, llm) because I'm locking in the skill by doing the thing in the garden."
-   User pixl97 used an LLM to improve an old fashioned cocktail recipe, verified the result by taste ("skimping on the orange oil/zest makes a huge difference"), and considered the knowledge locked in after one practical test — a low-stakes case where the learning loop closes almost immediately.


## A framework for using AI without ceding thinking {#a-framework-for-using-ai-without-ceding-thinking}

User RevEng laid out a discipline for using AI to "extend my capabilities" rather than "remove my agency":

-   **Debug** — let the AI hunt for things you'd miss.
-   **Review** — ask it to critique finished work for an outside perspective.
-   **Implement an already-decided design** — "I have already gone through the thoughtful engineering to decide what to do and how to do it. The rest amounts to translating pseudocode... Let it type what I would have typed anyway."
-   **Suggest ideas** — treat suggestions as one more input, not the verdict: "I don't take the AI at its word and let it decide what is best for me."

His summary maxim: "I am not replacing learning, thinking, or deciding."

A related, more compressed maxim from user iLoveOncall: "If you offload any of your thinking to AI, you're offloading too much of your thinking to AI. Offload your execution, not your thinking."


## Resources {#resources}

-   2026-07-15 ◦ [Are we offloading too much of our thinking to AI? (HN discussion)](https://news.ycombinator.com/item?id=48908178) — source of the practice-after pattern (contractor, gardening, cocktail anecdotes) and the RevEng/iLoveOncall frameworks above
-   2026-07-15 ◦ [Cognitive offloading]({{< relref "cognitive_offloading.md" >}}) — the hub topic covering the broader debate this practical framework responds to
-   2026-07-15 ◦ [AI coding assistants]({{< relref "coding_assistants.md" >}}) — see "Agency-preserving usage patterns" for the programming-specific application of these ideas
